Table of Contents
 Interface IIdeaLineSegment3D
Namespace
IdeaStatiCa.BimApi
Assembly
IdeaStatiCa.BimApi.dll
Represents the line segment of the element.
 Line segment is defined by two points returned by the StartNode and EndNode of the base class IIdeaSegment3D.
public interface IIdeaLineSegment3D : IIdeaSegment3D, IIdeaObject
Inherited Members
 IIdeaSegment3D.StartNode
 IIdeaSegment3D.EndNode
 IIdeaSegment3D.LocalCoordinateSystem
 IIdeaObject.Id
 IIdeaObject.Name
 Edit this page